Revit 2016 API
Surface Class
 This is a base class for all Revit surface types. It defines methods common to all surfaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public class Surface : IDisposable
Visual Basic
Public Class Surface _
	Implements IDisposable
Visual C++
public ref class Surface : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.Plane
See Also
Surface Members
Autodesk.Revit.DB Namespace